//решено частично нужна помощь
public class Task_2_9_ {
/*
Задание: Дан массив с числами. Проверьте, что в этом массиве есть число 5.
 Если есть - выведите 'да', а если нет - выведите 'нет'.
*/
        public static void main(String[] args) {
            int massivs[] = {2, 43, 5, 43, 14};
                        for (int i = 0; i < massivs.length; i++) {
                /*if (massiv[i] == 5) System.out.println("да");
                /*else if (massiv[i] != 5)System.out.println("нет");*/
                            while ((massivs[i] == 5)) {
                                System.out.println("да");
                                break;
                            }
                            if (massivs[i] != 5) {
                                System.out.println("нет");
                            }
}}}



